UFTOneAutomationTests/APITestCreateOrder/Log/vtd_user.log

2022-02-09 14:27:22,830 [1] INFO  - Loaded appender: FileAppenderInternal
2022-02-09 14:27:22,849 [1] INFO  - Loaded appender: FileAppenderExternal
2022-02-09 14:27:22,850 [1] INFO  - Loaded appender: UserLoggerAppender
2022-02-09 14:27:22,850 [1] INFO  - Loaded appender: FileAppenderInternal
2022-02-09 14:27:22,851 [1] INFO  - Loaded appender: FileAppenderExternal
2022-02-09 14:27:22,851 [1] INFO  - Loaded appender: UserLoggerAppender
2022-02-09 14:27:23,550 [9] INFO  - Step 'Start' : Step 'Start' started
2022-02-09 14:27:23,580 [9] INFO  - Step 'Start' ended successfully
2022-02-09 14:27:23,583 [9] INFO  - Step 'Test Flow' : Step 'Test Flow' started
2022-02-09 14:27:23,585 [9] INFO  - Step 'Iteration 1' : Step 'Iteration 1' started
2022-02-09 14:27:23,587 [9] INFO  - Step 'GetFlights' : Step 'GetFlights' started
2022-02-09 14:27:23,601 [9] INFO  - 
Request:

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
  <Body>
    <GetFlights xmlns="HP.SOAQ.SampleApp">
      <DepartureCity>Denver</DepartureCity>
      <ArrivalCity>Frankfurt</ArrivalCity>
      <FlightDate>2022-02-22T00:00:00+02:00</FlightDate>
    </GetFlights>
  </Body>
</Envelope>

2022-02-09 14:27:23,700 [9] INFO  - URL: http://localhost:8000/Flights_SOAP
2022-02-09 14:27:23,817 [9] INFO  - Returning the response to the previous channel
2022-02-09 14:27:23,820 [9] INFO  - 
Response:

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <GetFlightsResponse xmlns="HP.SOAQ.SampleApp">
      <GetFlightsResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>08:53 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>08:09 AM</DepartureTime>
          <FlightNumber>14686</FlightNumber>
          <Price>179.47</Price>
        </Flight>
        <Flight>
          <Airline>AF</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>10:00 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>08:00 AM</DepartureTime>
          <FlightNumber>15779</FlightNumber>
          <Price>161.9</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>08:45 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>08:00 AM</DepartureTime>
          <FlightNumber>15781</FlightNumber>
          <Price>105.4</Price>
        </Flight>
        <Flight>
          <Airline>AF</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>11:30 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>08:00 AM</DepartureTime>
          <FlightNumber>15782</FlightNumber>
          <Price>173.47</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>11:09 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>10:24 AM</DepartureTime>
          <FlightNumber>15785</FlightNumber>
          <Price>104</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>01:33 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>12:48 PM</DepartureTime>
          <FlightNumber>15789</FlightNumber>
          <Price>106</Price>
        </Flight>
        <Flight>
          <Airline>DL</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>04:42 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>03:12 PM</DepartureTime>
          <FlightNumber>15792</FlightNumber>
          <Price>178.47</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>03:57 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>03:12 PM</DepartureTime>
          <FlightNumber>15793</FlightNumber>
          <Price>105.3</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>06:29 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>05:45 PM</DepartureTime>
          <FlightNumber>16102</FlightNumber>
          <Price>110.8</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>01:41 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>12:57 PM</DepartureTime>
          <FlightNumber>16396</FlightNumber>
          <Price>120.4</Price>
        </Flight>
      </GetFlightsResult>
    </GetFlightsResponse>
  </s:Body>
</s:Envelope>

2022-02-09 14:27:23,842 [9] INFO  - Structural Validation: True
2022-02-09 14:27:23,847 [9] INFO  - Step 'GetFlights' ended successfully
2022-02-09 14:27:23,848 [9] INFO  - Step 'CreateFlightOrder' : Step 'CreateFlightOrder' started
2022-02-09 14:27:23,850 [9] INFO  - 
Request:

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/" xmlns:p1="http://www.w3.org/2001/XMLSchema-instance">
  <Body>
    <CreateFlightOrder xmlns="HP.SOAQ.SampleApp">
      <FlightOrder>
        <Class>Business</Class>
        <CustomerName>john</CustomerName>
        <DepartureDate>2022-02-22T00:00:00+02:00</DepartureDate>
        <FlightNumber>14686</FlightNumber>
        <NumberOfTickets>5</NumberOfTickets>
      </FlightOrder>
    </CreateFlightOrder>
  </Body>
</Envelope>

2022-02-09 14:27:23,852 [9] INFO  - URL: http://localhost:8000/Flights_SOAP
2022-02-09 14:27:23,873 [9] INFO  - Returning the response to the previous channel
2022-02-09 14:27:23,874 [9] INFO  - 
Response:

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <CreateFlightOrderResponse xmlns="HP.SOAQ.SampleApp">
      <CreateFlightOrderResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <OrderNumber>4033</OrderNumber>
        <TotalPrice>1794.7</TotalPrice>
      </CreateFlightOrderResult>
    </CreateFlightOrderResponse>
  </s:Body>
</s:Envelope>

2022-02-09 14:27:23,877 [9] INFO  - Structural Validation: True
2022-02-09 14:27:23,880 [9] INFO  - Step 'CreateFlightOrder' ended successfully
2022-02-09 14:27:23,881 [9] INFO  - Step 'Iteration 1' ended successfully
2022-02-09 14:27:23,882 [9] INFO  - Step 'Iteration 2' : Step 'Iteration 2' started
2022-02-09 14:27:23,883 [9] INFO  - Step 'GetFlights' : Step 'GetFlights' started
2022-02-09 14:27:23,885 [9] INFO  - 
Request:

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
  <Body>
    <GetFlights xmlns="HP.SOAQ.SampleApp">
      <DepartureCity>Denver</DepartureCity>
      <ArrivalCity>Frankfurt</ArrivalCity>
      <FlightDate>2022-02-22T00:00:00+02:00</FlightDate>
    </GetFlights>
  </Body>
</Envelope>

2022-02-09 14:27:23,887 [9] INFO  - URL: http://localhost:8000/Flights_SOAP
2022-02-09 14:27:23,892 [9] INFO  - Returning the response to the previous channel
2022-02-09 14:27:23,893 [9] INFO  - 
Response:

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <GetFlightsResponse xmlns="HP.SOAQ.SampleApp">
      <GetFlightsResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>08:53 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>08:09 AM</DepartureTime>
          <FlightNumber>14686</FlightNumber>
          <Price>179.47</Price>
        </Flight>
        <Flight>
          <Airline>AF</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>10:00 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>08:00 AM</DepartureTime>
          <FlightNumber>15779</FlightNumber>
          <Price>161.9</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>08:45 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>08:00 AM</DepartureTime>
          <FlightNumber>15781</FlightNumber>
          <Price>105.4</Price>
        </Flight>
        <Flight>
          <Airline>AF</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>11:30 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>08:00 AM</DepartureTime>
          <FlightNumber>15782</FlightNumber>
          <Price>173.47</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>11:09 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>10:24 AM</DepartureTime>
          <FlightNumber>15785</FlightNumber>
          <Price>104</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>01:33 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>12:48 PM</DepartureTime>
          <FlightNumber>15789</FlightNumber>
          <Price>106</Price>
        </Flight>
        <Flight>
          <Airline>DL</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>04:42 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>03:12 PM</DepartureTime>
          <FlightNumber>15792</FlightNumber>
          <Price>178.47</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>03:57 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>03:12 PM</DepartureTime>
          <FlightNumber>15793</FlightNumber>
          <Price>105.3</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>06:29 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>05:45 PM</DepartureTime>
          <FlightNumber>16102</FlightNumber>
          <Price>110.8</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>01:41 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>12:57 PM</DepartureTime>
          <FlightNumber>16396</FlightNumber>
          <Price>120.4</Price>
        </Flight>
      </GetFlightsResult>
    </GetFlightsResponse>
  </s:Body>
</s:Envelope>

2022-02-09 14:27:23,898 [9] INFO  - Structural Validation: True
2022-02-09 14:27:23,900 [9] INFO  - Step 'GetFlights' ended successfully
2022-02-09 14:27:23,901 [9] INFO  - Step 'CreateFlightOrder' : Step 'CreateFlightOrder' started
2022-02-09 14:27:23,903 [9] INFO  - 
Request:

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/" xmlns:p1="http://www.w3.org/2001/XMLSchema-instance">
  <Body>
    <CreateFlightOrder xmlns="HP.SOAQ.SampleApp">
      <FlightOrder>
        <Class>Business</Class>
        <CustomerName>john</CustomerName>
        <DepartureDate>2022-02-22T00:00:00+02:00</DepartureDate>
        <FlightNumber>14686</FlightNumber>
        <NumberOfTickets>5</NumberOfTickets>
      </FlightOrder>
    </CreateFlightOrder>
  </Body>
</Envelope>

2022-02-09 14:27:23,906 [9] INFO  - URL: http://localhost:8000/Flights_SOAP
2022-02-09 14:27:23,918 [9] INFO  - Returning the response to the previous channel
2022-02-09 14:27:23,922 [9] INFO  - 
Response:

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <CreateFlightOrderResponse xmlns="HP.SOAQ.SampleApp">
      <CreateFlightOrderResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <OrderNumber>4034</OrderNumber>
        <TotalPrice>1794.7</TotalPrice>
      </CreateFlightOrderResult>
    </CreateFlightOrderResponse>
  </s:Body>
</s:Envelope>

2022-02-09 14:27:23,932 [9] INFO  - Structural Validation: True
2022-02-09 14:27:23,937 [9] INFO  - Step 'CreateFlightOrder' ended successfully
2022-02-09 14:27:23,939 [9] INFO  - Step 'Iteration 2' ended successfully
2022-02-09 14:27:23,941 [9] INFO  - Step 'Iteration 3' : Step 'Iteration 3' started
2022-02-09 14:27:23,942 [9] INFO  - Step 'GetFlights' : Step 'GetFlights' started
2022-02-09 14:27:23,950 [9] INFO  - 
Request:

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
  <Body>
    <GetFlights xmlns="HP.SOAQ.SampleApp">
      <DepartureCity>Denver</DepartureCity>
      <ArrivalCity>Frankfurt</ArrivalCity>
      <FlightDate>2022-02-22T00:00:00+02:00</FlightDate>
    </GetFlights>
  </Body>
</Envelope>

2022-02-09 14:27:23,953 [9] INFO  - URL: http://localhost:8000/Flights_SOAP
2022-02-09 14:27:23,959 [9] INFO  - Returning the response to the previous channel
2022-02-09 14:27:23,960 [9] INFO  - 
Response:

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <GetFlightsResponse xmlns="HP.SOAQ.SampleApp">
      <GetFlightsResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>08:53 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>08:09 AM</DepartureTime>
          <FlightNumber>14686</FlightNumber>
          <Price>179.47</Price>
        </Flight>
        <Flight>
          <Airline>AF</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>10:00 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>08:00 AM</DepartureTime>
          <FlightNumber>15779</FlightNumber>
          <Price>161.9</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>08:45 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>08:00 AM</DepartureTime>
          <FlightNumber>15781</FlightNumber>
          <Price>105.4</Price>
        </Flight>
        <Flight>
          <Airline>AF</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>11:30 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>08:00 AM</DepartureTime>
          <FlightNumber>15782</FlightNumber>
          <Price>173.47</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>11:09 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>10:24 AM</DepartureTime>
          <FlightNumber>15785</FlightNumber>
          <Price>104</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>01:33 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>12:48 PM</DepartureTime>
          <FlightNumber>15789</FlightNumber>
          <Price>106</Price>
        </Flight>
        <Flight>
          <Airline>DL</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>04:42 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>03:12 PM</DepartureTime>
          <FlightNumber>15792</FlightNumber>
          <Price>178.47</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>03:57 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>03:12 PM</DepartureTime>
          <FlightNumber>15793</FlightNumber>
          <Price>105.3</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>06:29 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>05:45 PM</DepartureTime>
          <FlightNumber>16102</FlightNumber>
          <Price>110.8</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>01:41 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>12:57 PM</DepartureTime>
          <FlightNumber>16396</FlightNumber>
          <Price>120.4</Price>
        </Flight>
      </GetFlightsResult>
    </GetFlightsResponse>
  </s:Body>
</s:Envelope>

2022-02-09 14:27:23,964 [9] INFO  - Structural Validation: True
2022-02-09 14:27:23,966 [9] INFO  - Step 'GetFlights' ended successfully
2022-02-09 14:27:23,968 [9] INFO  - Step 'CreateFlightOrder' : Step 'CreateFlightOrder' started
2022-02-09 14:27:23,970 [9] INFO  - 
Request:

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/" xmlns:p1="http://www.w3.org/2001/XMLSchema-instance">
  <Body>
    <CreateFlightOrder xmlns="HP.SOAQ.SampleApp">
      <FlightOrder>
        <Class>Business</Class>
        <CustomerName>john</CustomerName>
        <DepartureDate>2022-02-22T00:00:00+02:00</DepartureDate>
        <FlightNumber>14686</FlightNumber>
        <NumberOfTickets>5</NumberOfTickets>
      </FlightOrder>
    </CreateFlightOrder>
  </Body>
</Envelope>

2022-02-09 14:27:23,972 [9] INFO  - URL: http://localhost:8000/Flights_SOAP
2022-02-09 14:27:23,981 [9] INFO  - Returning the response to the previous channel
2022-02-09 14:27:23,982 [9] INFO  - 
Response:

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <CreateFlightOrderResponse xmlns="HP.SOAQ.SampleApp">
      <CreateFlightOrderResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <OrderNumber>4035</OrderNumber>
        <TotalPrice>1794.7</TotalPrice>
      </CreateFlightOrderResult>
    </CreateFlightOrderResponse>
  </s:Body>
</s:Envelope>

2022-02-09 14:27:23,985 [9] INFO  - Structural Validation: True
2022-02-09 14:27:23,988 [9] INFO  - Step 'CreateFlightOrder' ended successfully
2022-02-09 14:27:23,989 [9] INFO  - Step 'Iteration 3' ended successfully
2022-02-09 14:27:23,990 [9] INFO  - Step 'Test Flow' ended successfully
2022-02-09 14:27:23,991 [9] INFO  - Step 'End' : Step 'End' started
2022-02-09 14:27:23,998 [9] INFO  - Step 'End' ended successfully
